In [1]:
 #! Bootcamb Day one Data Science 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.impute import SimpleImputer

# Load the dataset
df=pd.read_csv("../datasets/dataset.csv")

df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13608 entries, 0 to 13607
Data columns (total 20 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            13608 non-null  int64
 1   title                         13608 non-null  object
 2   url                           13608 non-null  object
 3   is_paid                       13608 non-null  bool
 4   num_subscribers               13608 non-null  int64
 5   avg_rating                    13608 non-null  float64
 6   avg_rating_recent             13608 non-null  float64
 7   rating                        13608 non-null  float64
 8   num_reviews                   13608 non-null  int64
 9   is_wishlisted                 13608 non-null  bool
 10  num_published_lectures        13608 non-null  int64
 11  num_published_practice_tests  13608 non-null  int64
 12  created                       13608 non-null  object
 13  published_time                13608 non-null  object
 14  discount_price__amount        12205 non-null  float64
 15  discount_price__currency      12205 non-null  object
 16  discount_price__price_string  12205 non-null  object
 17  price_detail__amount          13111 non-null  float64
 18  price_detail__currency        13111 non-null  object
 19  price_detail__price_string    13111 non-null  object
dtypes: bool(2), float64(5), int64(5), object(8)
memory usage: 1.9+ MB

,id,title,url,is_paid,num_subscribers,avg_rating,avg_rating_recent,rating,num_reviews,is_wishlisted,num_published_lectures,num_published_practice_tests,created,published_time,discount_price__amount,discount_price__currency,discount_price__price_string,price_detail__amount,price_detail__currency,price_detail__price_string
0,762616,The Complete SQL Bootcamp 2020: Go from Zero t...,/course/the-complete-sql-bootcamp/,True,295509,4.66019,4.67874,4.67874,78006,False,84,0,2016-02-14T22:57:48Z,2016-04-06T05:16:11Z,455.0,INR,₹455,8640.0,INR,"₹8,640"
1,937678,Tableau 2020 A-Z: Hands-On Tableau Training fo...,/course/tableau10/,True,209070,4.58956,4.60015,4.60015,54581,False,78,0,2016-08-22T12:10:18Z,2016-08-23T16:59:49Z,455.0,INR,₹455,8640.0,INR,"₹8,640"
2,1361790,PMP Exam Prep Seminar - PMBOK Guide 6,/course/pmp-pmbok6-35-pdus/,True,155282,4.59491,4.59326,4.59326,52653,False,292,2,2017-09-26T16:32:48Z,2017-11-14T23:58:14Z,455.0,INR,₹455,8640.0,INR,"₹8,640"
3,648826,The Complete Financial Analyst Course 2020,/course/the-complete-financial-analyst-course/,True,245860,4.54407,4.53772,4.53772,46447,False,338,0,2015-10-23T13:34:35Z,2016-01-21T01:38:48Z,455.0,INR,₹455,8640.0,INR,"₹8,640"
4,637930,An Entire MBA in 1 Course:Award Winning Busine...,/course/an-entire-mba-in-1-courseaward-winning...,True,374836,4.47080,4.47173,4.47173,41630,False,83,0,2015-10-12T06:39:46Z,2016-01-11T21:39:33Z,455.0,INR,₹455,8640.0,INR,"₹8,640"

<hr style="border: 2px solid #fb04ff; width: 80%;">
<h1 style="text-align:center; font-family: 'Arial', sans-serif; color:#fb04ff;">
    🧠 1. Data Exploration📊
</h1>
<hr style="border: 2px solid #fb04ff; width: 80%;">

In [2]:

# Drop unnecessary columns for simplicity
columns_to_drop = ['url', 'discount_price__currency', 'discount_price__price_string',
                   'price_detail__currency', 'price_detail__price_string','avg_rating_recent','avg_rating']
df.drop(columns=columns_to_drop,inplace=True,axis=1)
df.info()
df.head(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13608 entries, 0 to 13607
Data columns (total 13 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            13608 non-null  int64
 1   title                         13608 non-null  object
 2   is_paid                       13608 non-null  bool
 3   num_subscribers               13608 non-null  int64
 4   rating                        13608 non-null  float64
 5   num_reviews                   13608 non-null  int64
 6   is_wishlisted                 13608 non-null  bool
 7   num_published_lectures        13608 non-null  int64
 8   num_published_practice_tests  13608 non-null  int64
 9   created                       13608 non-null  object
 10  published_time                13608 non-null  object
 11  discount_price__amount        12205 non-null  float64
 12  price_detail__amount          13111 non-null  float64
dtypes: bool(2), float64(3), int64(5), object(3)
memory usage: 1.2+ MB

,id,title,is_paid,num_subscribers,rating,num_reviews,is_wishlisted,num_published_lectures,num_published_practice_tests,created,published_time,discount_price__amount,price_detail__amount
0,762616,The Complete SQL Bootcamp 2020: Go from Zero t...,True,295509,4.67874,78006,False,84,0,2016-02-14T22:57:48Z,2016-04-06T05:16:11Z,455.0,8640.0
1,937678,Tableau 2020 A-Z: Hands-On Tableau Training fo...,True,209070,4.60015,54581,False,78,0,2016-08-22T12:10:18Z,2016-08-23T16:59:49Z,455.0,8640.0

In [3]:
df['created'].head()

0    2016-02-14T22:57:48Z
1    2016-08-22T12:10:18Z
2    2017-09-26T16:32:48Z
3    2015-10-23T13:34:35Z
4    2015-10-12T06:39:46Z
Name: created, dtype: object

In [4]:
df['created'] = pd.to_datetime(df['created'])
df['published_time'] = pd.to_datetime(df['published_time'])
df['created'].head()

0   2016-02-14 22:57:48+00:00
1   2016-08-22 12:10:18+00:00
2   2017-09-26 16:32:48+00:00
3   2015-10-23 13:34:35+00:00
4   2015-10-12 06:39:46+00:00
Name: created, dtype: datetime64[ns, UTC]

### Changing Currency to USD

**in this step we will convert the currency from INR (Indian Rupees) to USD by multiply the the actual data by 83.33**

In [5]:
df['discount_price__amount']

0        455.0
1        455.0
2        455.0
3        455.0
4        455.0
         ...
13603      NaN
13604      NaN
13605      NaN
13606      NaN
13607      NaN
Name: discount_price__amount, Length: 13608, dtype: float64

In [6]:
df['discount_price__amount']= df['discount_price__amount']/83.33
df['price_detail__amount']= df['price_detail__amount']/83.33
df['discount_price__amount']

0        5.460218
1        5.460218
2        5.460218
3        5.460218
4        5.460218
           ...
13603         NaN
13604         NaN
13605         NaN
13606         NaN
13607         NaN
Name: discount_price__amount, Length: 13608, dtype: float64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13608 entries, 0 to 13607
Data columns (total 13 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            13608 non-null  int64
 1   title                         13608 non-null  object
 2   is_paid                       13608 non-null  bool
 3   num_subscribers               13608 non-null  int64
 4   rating                        13608 non-null  float64
 5   num_reviews                   13608 non-null  int64
 6   is_wishlisted                 13608 non-null  bool
 7   num_published_lectures        13608 non-null  int64
 8   num_published_practice_tests  13608 non-null  int64
 9   created                       13608 non-null  datetime64[ns, UTC]
 10  published_time                13608 non-null  datetime64[ns, UTC]
 11  discount_price__amount        12205 non-null  float64
 12  price_detail__amount          13111 non-null  float64
dtypes: bool(2), datetime64[ns, UTC](2), float64(3), int64(5), object(1)
memory usage: 1.2+ MB

### Percent of discount
**in this step we will calculate the percentage of disconted price using the difference between the total amont and the dicounted amont column, and then we will impute the missing values in each column**

In [8]:
df['discount_percentage'] = (df['discount_price__amount'] / df['price_detail__amount'])*100
df['discount_percentage']

0        5.266204
1        5.266204
2        5.266204
3        5.266204
4        5.266204
           ...
13603         NaN
13604         NaN
13605         NaN
13606         NaN
13607         NaN
Name: discount_percentage, Length: 13608, dtype: float64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13608 entries, 0 to 13607
Data columns (total 14 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            13608 non-null  int64
 1   title                         13608 non-null  object
 2   is_paid                       13608 non-null  bool
 3   num_subscribers               13608 non-null  int64
 4   rating                        13608 non-null  float64
 5   num_reviews                   13608 non-null  int64
 6   is_wishlisted                 13608 non-null  bool
 7   num_published_lectures        13608 non-null  int64
 8   num_published_practice_tests  13608 non-null  int64
 9   created                       13608 non-null  datetime64[ns, UTC]
 10  published_time                13608 non-null  datetime64[ns, UTC]
 11  discount_price__amount        12205 non-null  float64
 12  price_detail__amount          13111 non-null  float64
 13  discount_percentage           12205 non-null  float64
dtypes: bool(2), datetime64[ns, UTC](2), float64(4), int64(5), object(1)
memory usage: 1.3+ MB

In [10]:
# Handle missing values in numeric columns using mean imputation
numeric_columns = ['discount_price__amount','discount_percentage', 'price_detail__amount']
imputer = SimpleImputer(strategy='median')
df[numeric_columns] = imputer.fit_transform(df[numeric_columns])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13608 entries, 0 to 13607
Data columns (total 14 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            13608 non-null  int64
 1   title                         13608 non-null  object
 2   is_paid                       13608 non-null  bool
 3   num_subscribers               13608 non-null  int64
 4   rating                        13608 non-null  float64
 5   num_reviews                   13608 non-null  int64
 6   is_wishlisted                 13608 non-null  bool
 7   num_published_lectures        13608 non-null  int64
 8   num_published_practice_tests  13608 non-null  int64
 9   created                       13608 non-null  datetime64[ns, UTC]
 10  published_time                13608 non-null  datetime64[ns, UTC]
 11  discount_price__amount        13608 non-null  float64
 12  price_detail__amount          13608 non-null  float64
 13  discount_percentage           13608 non-null  float64
dtypes: bool(2), datetime64[ns, UTC](2), float64(4), int64(5), object(1)
memory usage: 1.3+ MB

In [11]:
df['title'] = df['title'].str.lower()
df['title'] = df['title'].str.strip().replace(r'\s+', ' ', regex=True)
df['title'] = df['title'].str.replace(r'[^\w\s]', '', regex=True)

In [12]:
def categorize_title(title):
    title_lower = title.lower()
    if 'sql' in title_lower or 'mysql' in title_lower or 'database' in title_lower:
        return 'Database'
    elif 'tableau' in title_lower or 'power bi' in title_lower or 'data viz' in title_lower:
        return 'Data Visualization'
    elif 'excel' in title_lower or 'spreadsheet' in title_lower:
        return 'Spreadsheet'
    elif any(kw in title_lower for kw in ['agile', 'scrum', 'pmp', 'project management']):
        return 'Project Management'
    elif any(kw in title_lower for kw in ['financial', 'finance', 'accounting']):
        return 'Finance'
    elif 'mba' in title_lower or 'business' in title_lower or 'enterprise' in title_lower:
        return 'Business'
    elif any(kw in title_lower for kw in ['write', 'writing', 'editorial']):
        return 'Writing'
    elif 'sale' in title_lower or 'marketing' in title_lower:
        return 'Sales/Marketing'
    elif any(kw in title_lower for kw in ['data science', 'analytics', 'machine learning']):
        return 'Data Science'
    elif 'management' in title_lower:
        return 'Management'
    elif 'leadership' in title_lower:
        return 'Leadership'
    elif 'communication' in title_lower:
        return 'Communication'
    else:
        return 'Other'

df['category'] = df['title'].apply(categorize_title)
df.head(2)

,id,title,is_paid,num_subscribers,rating,num_reviews,is_wishlisted,num_published_lectures,num_published_practice_tests,created,published_time,discount_price__amount,price_detail__amount,discount_percentage,category
0,762616,the complete sql bootcamp 2020 go from zero to...,True,295509,4.67874,78006,False,84,0,2016-02-14 22:57:48+00:00,2016-04-06 05:16:11+00:00,5.460218,103.684147,5.266204,Database
1,937678,tableau 2020 az handson tableau training for d...,True,209070,4.60015,54581,False,78,0,2016-08-22 12:10:18+00:00,2016-08-23 16:59:49+00:00,5.460218,103.684147,5.266204,Data Visualization

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13608 entries, 0 to 13607
Data columns (total 15 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            13608 non-null  int64
 1   title                         13608 non-null  object
 2   is_paid                       13608 non-null  bool
 3   num_subscribers               13608 non-null  int64
 4   rating                        13608 non-null  float64
 5   num_reviews                   13608 non-null  int64
 6   is_wishlisted                 13608 non-null  bool
 7   num_published_lectures        13608 non-null  int64
 8   num_published_practice_tests  13608 non-null  int64
 9   created                       13608 non-null  datetime64[ns, UTC]
 10  published_time                13608 non-null  datetime64[ns, UTC]
 11  discount_price__amount        13608 non-null  float64
 12  price_detail__amount          13608 non-null  float64
 13  discount_percentage           13608 non-null  float64
 14  category                      13608 non-null  object
dtypes: bool(2), datetime64[ns, UTC](2), float64(4), int64(5), object(2)
memory usage: 1.4+ MB

In [14]:
df['category'].value_counts()

category
Other                 8685
Business              1450
Finance               1119
Management             523
Sales/Marketing        516
Project Management     374
Spreadsheet            263
Writing                259
Data Visualization     129
Data Science            99
Leadership              74
Communication           71
Database                46
Name: count, dtype: int64